# CentralModelAlreadyExistsException Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
CentralModelAlreadyExistsException Class
Members See Also
---
Exception is thrown when the central model already exists at the specified location.
**Namespace:** Autodesk.Revit.Exceptions**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
[SerializableAttribute]
public class CentralModelAlreadyExistsException : CentralModelException
```

Visual Basic
---
```text
<SerializableAttribute> _
Public Class CentralModelAlreadyExistsException _
	Inherits CentralModelException
```

Visual C++
---
```text
[SerializableAttribute]
public ref class CentralModelAlreadyExistsException : public CentralModelException
```

# Inheritance Hierarchy
System..::..Object System..::..Exception Autodesk.Revit.Exceptions..::..ApplicationException Autodesk.Revit.Exceptions..::..CentralModelException Autodesk.Revit.Exceptions..::..CentralModelAlreadyExistsException
# See Also
CentralModelAlreadyExistsException Members
Autodesk.Revit.Exceptions Namespace